## pandas之loc  
还有更多的经过pandas优化过的选择方式：  

df.loc 通过标签索引行数据  loc:locate

df.iloc 通过位置获取行数据  iloc:index locate

In [1]:
import pandas as pd
import numpy as np
import string

In [2]:
t = pd.DataFrame(np.arange(12).reshape((3,4)),index=list(string.ascii_uppercase[:3]),columns=list("WXYZ"))

In [3]:
t

   W  X   Y   Z
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [1]:
# t["A","W"]

In [15]:
t.loc["A",["W","Z"]]

W    0
Z    3
Name: A, dtype: int32

In [16]:
type(t.loc["A",["W","Z"]])

pandas.core.series.Series

In [17]:
t.loc[["A","C"],["W","Z"]]  # 选择间隔的多行多列

   W   Z
A  0   3
C  8  11

In [18]:
t.loc["A":"C",["W","Z"]]

   W   Z
A  0   3
B  4   7
C  8  11

## pandas之iloc

In [20]:
t.iloc[1:3,[2,3]]

    Y   Z
B   6   7
C  10  11

In [21]:
t.iloc[1:3,1:3]

   X   Y
B  5   6
C  9  10

In [23]:
t.iloc[1:2,0:2] = 200

In [24]:
t

     W    X   Y   Z
A    0    1   2   3
B  200  200   6   7
C    8    9  10  11

## pandas之布尔索引  
回到之前狗的名字的问题上，假如我们想找到所有的使用次数超过800的狗的名字，应该怎么选择？

In [27]:
df = pd.read_csv("./dogNames2.csv")

In [28]:
df.head()

  Row_Labels  Count_AnimalName
0          1                 1
1          2                 2
2      40804                 1
3      90201                 1
4      90203                 1

In [29]:
df[df["Count_AnimalName"]>800]

      Row_Labels  Count_AnimalName
1156       BELLA              1195
2660     CHARLIE               856
3251        COCO               852
9140         MAX              1153
12368      ROCKY               823

回到之前狗的名字的问题上，假如我们想找到所有的使用次数超过700并且名字的字符串的长度大于4的狗的名字，应该怎么选择？

In [31]:
df[(df["Row_Labels"].str.len()>4) & (df["Count_AnimalName"]>700)]

      Row_Labels  Count_AnimalName
1156       BELLA              1195
2660     CHARLIE               856
8552       LUCKY               723
12368      ROCKY               823

问题 .str是什么方法？

## pandas之字符串方法

In [34]:
df1 = df[(df["Row_Labels"].str.len()>4) & (df["Count_AnimalName"]>700)]

In [36]:
df1

      Row_Labels  Count_AnimalName
1156       BELLA              1195
2660     CHARLIE               856
8552       LUCKY               723
12368      ROCKY               823

In [37]:
df1["Row_Labels"].str.contains("BELLA")

1156      True
2660     False
8552     False
12368    False
Name: Row_Labels, dtype: bool

In [39]:
df1["Row_Labels"].str.lower()

1156       bella
2660     charlie
8552       lucky
12368      rocky
Name: Row_Labels, dtype: object

In [40]:
df1["Row_Labels"].str.upper()

1156       BELLA
2660     CHARLIE
8552       LUCKY
12368      ROCKY
Name: Row_Labels, dtype: object

In [45]:
df1["Row_Labels"].str.replace("A","B")

1156       BELLB
2660     CHBRLIE
8552       LUCKY
12368      ROCKY
Name: Row_Labels, dtype: object

In [46]:
df1["Row_Labels"].str.split("C")

1156        [BELLA]
2660     [, HARLIE]
8552       [LU, KY]
12368      [RO, KY]
Name: Row_Labels, dtype: object